{
    "basics":{
        "name":"Sean McQueen",
        "label":"Software Engineer",
        "picture":"",
        "email":"sean@mcqueen.net",
        "phone":"(206) 718-7746",
        "website":"http://mcqueen.tv",
        "summary":"User-minded Software Engineer with leadership experience, design chops and project management experience. Looking for Product Management roles.",
        "location":{
            "address":"Bush St",
            "postalCode":"CA 94109",
            "city":"San Francisco",
            "countryCode":"US",
            "region":"California"
        },
        "profiles":[
            {
                "network":"LinkedIn",
                "username":"snmcqueen",
                "url":"https://www.linkedin.com/in/snmcqueen"
            },
            {
                "network":"Twitter",
                "username":"snmcqueen",
                "url":"https://twitter.com/snmcqueen"
            },
            {
                "network":"Facebook",
                "username":"Sean McQueen",
                "url":"https://www.facebook.com/sean.mcqueen"
            }
        ]
    },
    "work":[
        {
            "company":"Nextdoor",
            "position":"Software Engineer",
            "website":"http://nextdoor.com",
            "startDate":"2014-01-01",
            "endDate":"Current",
            "summary":"Joined Nextdoor as employee ~50 after a 2013 summer internship. Initialially worked on infrastructure projects during a critical period of infrastructure work for the company (in reaction to increased user growth). I have committed code on every platform we support and every level of our stack. I currently work on new mobile product inititives.",
            "highlights":[
                "Learned Objective-C and the iOS platform while on a deadline to ship code: implemented multiple photo uploading and viewing on iOS and web. Handled limited server thread capacity by uploading photos directly to AWS S3. Increased number of photo posts by over 100%.",
                "Led a cross-platform team of 7 engineers (web, iOS & Android) to build the 2014 Holiday Cheer Map, an user growth inititive. Worked with designers and PM to spec the feature and plan for launch. Responsible for negotiating and then hitting aggressive development deadlines. Increased user sign-up during the slow holiday season by 16,000 users.",
                "Led iOS development of Nextdoor Now's MVP (\"Nextdoor Babysitting\") with a team of 2 other iOS engineers over a 4 month period.",
                "Developed our 2015 Engineering Intern program. Interviewed dozens of intern candidates during the hiring process. Ran an onboarding process for interns that included talks by key employees. Helped plan social events (including lunch talks with Nextdoor executives and founders)."
            ]
        },
        {
            "company":"CMC Forum",
            "position":"Managing Editor",
            "website":"https://cmcforum.com/",
            "startDate":"2013-04-15",
            "endDate":"2012-04-15",
            "summary":"Managing editor for college newspaper with 30,000 pageviews a month",
            "highlights":[
                "Worked with Editor-in-Chief to manage a staff of 30.",
                "Managed a publishing schedule, ran weekly editorial meetings and helped plan content about campus issues and topics of interest for college students.",
                "Managed the site's social media presence -- increased traffic to the website through our Facebook page."
            ]
        },
        {
            "company":"Atlassian",
            "position":"Software Development Intern",
            "website":"https://www.atlassian.com/",
            "startDate":"2012-06-01",
            "endDate":"2012-08-25",
            "summary":"Worked with ",
            "highlights":[
                "Acted in a Product Management role on a team of 5 technical interns.",
                "Designed a charting plugin for Atlassian's Confluence wiki product.",
                "TODO"
            ]
        }
    ],
    "education":[
        {
            "institution":"Claremont McKenna College",
            "area":"Computer Science & Economics",
            "studyType":"Bachelor",
            "startDate":"Fall 2009",
            "endDate":"Fall 2014",
            "gpa":"3.5",
            "courses":[

            ]
        }
    ],
    "skills":[
        {
            "name":"iOS Development",
            "level":"Experienced",
            "keywords":[
                "Swift",
                "Objective-C",
                "iOS 7 - 9"
            ]
        },
        {
            "name":"Web Development",
            "level":"Proficient",
            "keywords":[
                "HTML",
                "JavaScript"
            ]
        },
        {
            "name":"UX Design",
            "level":"Beginner",
            "keywords":[
                "Balsamiq",
                "Photoshop"
            ]
        }
    ],
    "interests":[
        {
            "name":"Improv",
            "keywords":[
                "Participated in weekly classes for almost a year",
                "Perform in long form improv comedy shows (30 minute sets)"
            ]
        }
    ]
}